; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v8 - type_2 ?v6 - type_1)
 	      (pred_4 ?v3 - object ?v6 - type_1)
	      (pred_3 ?v8 - type_2 ?v5 - type_3)
	      (pred_1 ?v8 - type_2 ?v3 - object ?v5 - type_3))

   (:action op_2
       :parameters  (?v8 - type_2 ?v1 ?v7 - type_1)
       :precondition (and  (pred_2 ?v8 ?v1))
       :effect (and  (pred_2 ?v8 ?v7)
		     (not (pred_2 ?v8 ?v1))))

   (:action op_1
       :parameters (?v8 - type_2 ?v4 - object ?v2 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_4 ?v4 ?v2) (pred_2 ?v8 ?v2) (pred_3 ?v8 ?v5))
       :effect (and (pred_1 ?v8 ?v4 ?v5)
		    (not (pred_4 ?v4 ?v2)) 
		    (not (pred_3 ?v8 ?v5))))

   (:action op_3
       :parameters (?v8 - type_2 ?v4 - object ?v2 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v8 ?v4 ?v5) (pred_2 ?v8 ?v2))
       :effect (and (pred_4 ?v4 ?v2)
		    (pred_3 ?v8 ?v5)
		    (not (pred_1 ?v8 ?v4 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_01 obj_07 - type_2
obj_13 obj_04 obj_09 obj_05 - type_3
obj_06 obj_02 obj_12 obj_10 - type_1
obj_03 obj_11 obj_08 - object)
(:init
(pred_2 obj_01 obj_02)
(pred_3 obj_01 obj_13)
(pred_3 obj_01 obj_04)
(pred_2 obj_07 obj_02)
(pred_3 obj_07 obj_09)
(pred_3 obj_07 obj_05)
(pred_4 obj_03 obj_10)
(pred_4 obj_11 obj_06)
(pred_4 obj_08 obj_02)
)
(:goal
(and
(pred_4 obj_03 obj_12)
(pred_4 obj_11 obj_06)
(pred_4 obj_08 obj_12)
)
)

(:constraints
  (always (not (pred_2 obj_01 obj_12)))
)
)

; plan
1. (op_1 obj_01 obj_08 obj_02 obj_04)
   deleted: (pred_4 obj_08 obj_02) (pred_3 obj_01 obj_04)
   added: (pred_1 obj_01 obj_08 obj_04)
   goals met: 1 of 3
2. (op_2 obj_07 obj_02 obj_06)
   deleted: (pred_2 obj_07 obj_02)
   added: (pred_2 obj_07 obj_06)
   goals met: 1 of 3
3. (op_2 obj_01 obj_02 obj_10)
   deleted: (pred_2 obj_01 obj_02)
   added: (pred_2 obj_01 obj_10)
   goals met: 1 of 3
4. (op_2 obj_07 obj_06 obj_10)
   deleted: (pred_2 obj_07 obj_06)
   added: (pred_2 obj_07 obj_10)
   goals met: 1 of 3
5. (op_1 obj_07 obj_03 obj_10 obj_05)
   deleted: (pred_4 obj_03 obj_10) (pred_3 obj_07 obj_05)
   added: (pred_1 obj_07 obj_03 obj_05)
   goals met: 1 of 3
6. (op_3 obj_01 obj_08 obj_10 obj_04)
   deleted: (pred_1 obj_01 obj_08 obj_04)
   added: (pred_4 obj_08 obj_10) (pred_3 obj_01 obj_04)
   goals met: 1 of 3
7. (op_2 obj_07 obj_10 obj_12)
   deleted: (pred_2 obj_07 obj_10)
   added: (pred_2 obj_07 obj_12)
   goals met: 1 of 3
8. (op_3 obj_07 obj_03 obj_12 obj_05)
   deleted: (pred_1 obj_07 obj_03 obj_05)
   added: (pred_4 obj_03 obj_12) (pred_3 obj_07 obj_05)
   goals met: 2 of 3
9. (op_2 obj_07 obj_12 obj_10)
   deleted: (pred_2 obj_07 obj_12)
   added: (pred_2 obj_07 obj_10)
   goals met: 2 of 3
10. (op_1 obj_07 obj_08 obj_10 obj_05)
   deleted: (pred_4 obj_08 obj_10) (pred_3 obj_07 obj_05)
   added: (pred_1 obj_07 obj_08 obj_05)
   goals met: 2 of 3
11. (op_2 obj_07 obj_10 obj_12)
   deleted: (pred_2 obj_07 obj_10)
   added: (pred_2 obj_07 obj_12)
   goals met: 2 of 3
12. (op_3 obj_07 obj_08 obj_12 obj_05)
   deleted: (pred_1 obj_07 obj_08 obj_05)
   added: (pred_4 obj_08 obj_12) (pred_3 obj_07 obj_05)
   goals met: 3 of 3
